export default {
  projections: {
    ГрафикОтпускаE: {
      номер: {
        __caption__: 'Номер'
      },
      дата: {
        __caption__: 'Дата составления'
      },
      датаНач: {
        __caption__: 'Дата начала отпуска'
      },
      колДней: {
        __caption__: 'Количество дней'
      },
      сотрудники: {
        __caption__: 'Сотрудники',
        фамилия: {
          __caption__: 'Фамилия'
        },
        имя: {
          __caption__: 'Имя'
        },
        отчество: {
          __caption__: 'Отчество'
        }
      },
      отправлено: {
        __caption__: 'Отправлено'
      }
    },
    ГрафикОтпускаL: {
      номер: {
        __caption__: 'Номер'
      },
      дата: {
        __caption__: 'Дата составления'
      },
      датаНач: {
        __caption__: 'Дата начала'
      },
      колДней: {
        __caption__: 'Количество дней'
      },
      сотрудники: {
        __caption__: 'Фамилия',
        фамилия: {
          __caption__: 'Фамилия'
        },
        имя: {
          __caption__: 'Имя'
        },
        отчество: {
          __caption__: 'Отчество'
        }
      },
      отправлено: {
        __caption__: 'Отправлено'
      }
    }
  },
  validations: {
    дата: {
      __caption__: 'Дата составления'
    },
    датаНач: {
      __caption__: 'Дата начала отпуска'
    },
    колДней: {
      __caption__: 'Количество дней'
    },
    номер: {
      __caption__: 'Номер'
    },
    отправлено: {
      __caption__: 'Отправлено'
    },
    сотрудники: {
      __caption__: 'Сотрудники'
    }
  }
};
